sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
            struct station_config config = {};
            strncpy(reinterpret_cast<char *>(config.ssid), event.ssid.c_str(), sizeof(config.ssid));
            strncpy(reinterpret_cast<char *>(config.password), Network::WiFi::getPassword(), sizeof(config.password));
            memcpy(config.bssid, event.bssid, sizeof(event.bssid));
            config.bssid_set = 0;

        #error TODO check
        // to use quickconnect, WiFi needs to be enabled during boot and the default config loaded

            // check if something has changed
            if (memcmp(&config, &defaultCfg, sizeof(config)) != 0) {
                wifi_station_set_config(&config);
                __DBG_printf("updated WiFi defualt configuration");
            }
        #endif

        // #if defined(ESP32)
        //     auto hostname = System::Device::getName();
        //     __LDBG_printf("WiFi.setHostname(%s)", hostname);
        //     if (!WiFi.setHostname(hostname)) {
        //         __LDBG_printf("WiFi.setHostname(%s) failed", hostname);
        //     }
        // #endif

    }

}

void KFCFWConfiguration::_onWiFiDisconnectCb(const WiFiEventStationModeDisconnected &event)
{
    __LDBG_printf("reason=%d error=%s wifi_connected=%u wifi_up=%u is_connected=%u ip=%s", event.reason, WiFi_disconnect_reason(event.reason), _wifiConnected, _wifiUp, WiFi.isConnected(), WiFi.localIP().toString().c_str());

    if (_wifiConnected) {
        #if !IOT_WEATHER_STATION_WS2812_NUM
            BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FAST);
        #endif

        Logger_notice(F("WiFi disconnected, SSID %s, reason %s, had %sIP address"), event.ssid.c_str(), WiFi_disconnect_reason(event.reason), _wifiUp ? emptyString.c_str() : PSTR("no "));
        _wifiConnected = 0;
        _wifiUp = 0;
        LoopFunctions::callOnce([event]() {
            WiFiCallbacks::callEvent(WiFiCallbacks::EventType::DISCONNECTED, (void *)&event);
        });
        if (event.reason == WIFI_DISCONNECT_REASON_AUTH_EXPIRE) {
            config.reconfigureWiFi(F("Authentication expired, reconfiguring WiFi adapter"));
        }

    }
    #if defined(ESP32)
        else {
            //_onWiFiDisconnectCb 202 = AUTH_FAIL
            if (event.reason == 202) {
                __DBG_printf_E("force WiFi.begin()");
                WiFi.begin();
            }
        }
    #endif
}

void KFCFWConfiguration::_onWiFiGotIPCb(const WiFiEventStationModeGotIP &event)
{
    // auto ip = event.ip.toString();
    // auto mask = event.mask.toString();
    // auto gw = event.gw.toString();
    // auto dns1 = WiFi.dnsIP().toString();
    // auto dns2 = WiFi.dnsIP(1).toString();
    _wifiUp = millis();
    if (_wifiUp == 0) {
        _wifiUp++;
    }
    // __LDBG_printf("%s", ip.c_str(), mask.c_str(), gw.c_str(), dns1.c_str(), dns2.c_str(), _wifiConnected, _wifiUp, WiFi.isConnected(), WiFi.localIP().toString().c_str());

    auto networkCfg = Network::Settings::getConfig().stations[getWiFiConfigurationNum()];

    PrintString msg = networkCfg.isDHCPEnabled() ? F("DHCP") : F("Static configuration");
    msg.print(F(": IP/Net "));
    if (IPAddress_isValid(event.ip)) {
        event.ip.printTo(msg);
        if (IPAddress_isValid(event.mask)) {
            msg.print('/');
            event.mask.printTo(msg);
        }
    }
    if (IPAddress_isValid(event.gw)) {
        msg.print(F(" GW "));
        event.gw.printTo(msg);
    }
    msg.print(F(" DNS: "));
    if (IPAddress_isValid(WiFi.dnsIP(0))) {
        WiFi.dnsIP(0).printTo(msg);
    }
    if (IPAddress_isValid(WiFi.dnsIP(1))) {
        msg.print('/');
        WiFi.dnsIP(1).printTo(msg);
    }
    Logger_notice(msg);

    setWiFiConnectLedMode();

    #if ENABLE_DEEP_SLEEP
        config.storeStationConfig(event.ip, event.mask, event.gw);
    #endif
    LoopFunctions::callOnce([event]() {
        WiFiCallbacks::callEvent(WiFiCallbacks::EventType::CONNECTED, (void *)&event);
    });
}

void KFCFWConfiguration::setWiFiConnectLedMode()
{
    #if __LED_BUILTIN != IGNORE_BUILTIN_LED_PIN_ID
        if (config.isSafeMode()) {
            BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::SOS);
        }
        else {
            auto mode = System::Device::getConfig().getStatusLedMode();
            if (mode != System::Device::StatusLEDModeType::OFF) {
                if (WiFi.isConnected()) {
                    #if !IOT_WEATHER_STATION_WS2812_NUM
                        BUILTIN_LED_SET(mode == System::Device::StatusLEDModeType::OFF_WHEN_CONNECTED ? BlinkLEDTimer::BlinkType::OFF : BlinkLEDTimer::BlinkType::SOLID);
                    #endif
                }
                else {
                    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FAST);
                }
            }
        }
    #endif
}

void KFCFWConfiguration::_onWiFiOnDHCPTimeoutCb()
{
    __LDBG_printf("KFCFWConfiguration::_onWiFiOnDHCPTimeoutCb()");
    #if defined(ESP32)
        Logger_error(F("Lost DHCP IP"));
    #else
        Logger_error(F("DHCP timeout"));
    #endif
    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);
}

void KFCFWConfiguration::_softAPModeStationConnectedCb(const WiFiEventSoftAPModeStationConnected &event)
{
    __LDBG_printf("KFCFWConfiguration::_softAPModeStationConnectedCb()");
    Logger_notice(F("Station connected [%s]"), mac2String(event.mac).c_str());
}

void KFCFWConfiguration::_softAPModeStationDisconnectedCb(const WiFiEventSoftAPModeStationDisconnected &event)
{
    __LDBG_printf("KFCFWConfiguration::_softAPModeStationDisconnectedCb()");
    Logger_notice(F("Station disconnected [%s]"), mac2String(event.mac).c_str());
}

#if defined(ESP32)

void KFCFWConfiguration::_onWiFiEvent(WiFiEvent_t event, WiFiEventInfo_t info)
{
    switch(event) {
        case WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_CONNECTED: {
                WiFiEventStationModeConnected dst;
                dst.ssid = reinterpret_cast<const char *>(info.wifi_sta_connected.ssid);
                MEMNCPY_S(dst.bssid, info.wifi_sta_connected.bssid);
                dst.channel = info.wifi_sta_connected.channel;
                config._onWiFiConnectCb(dst);
            } break;
        case WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_DISCONNECTED: {
                WiFiEventStationModeDisconnected dst;
                dst.ssid = reinterpret_cast<const char *>(info.wifi_sta_disconnected.ssid);
                MEMNCPY_S(dst.bssid, info.wifi_sta_disconnected.bssid);
                dst.reason = (WiFiDisconnectReason)info.wifi_sta_disconnected.reason;
                config._onWiFiDisconnectCb(dst);
            } break;
        #if DEBUG
            case WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_GOT_IP6: {
                    __DBG_printf("ARDUINO_EVENT_WIFI_STA_GOT_IP6 addr=%04X:%04X:%04X:%04X", info.got_ip6.ip6_info.ip.addr[0], info.got_ip6.ip6_info.ip.addr[1], info.got_ip6.ip6_info.ip.addr[2], info.got_ip6.ip6_info.ip.addr[3]);
                } break;
        #endif
        case WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_GOT_IP: {
                WiFiEventStationModeGotIP dst;
                dst.ip = info.got_ip.ip_info.ip.addr;
                dst.gw = info.got_ip.ip_info.gw.addr;
                dst.mask = info.got_ip.ip_info.netmask.addr;
                config._onWiFiGotIPCb(dst);
            } break;
        case WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_LOST_IP: {
                config._onWiFiOnDHCPTimeoutCb();
            } break;
        case WiFiEvent_t::ARDUINO_EVENT_WIFI_AP_STACONNECTED: {
                WiFiEventSoftAPModeStationConnected dst;
                dst.aid = info.wifi_ap_staconnected.aid;
                MEMNCPY_S(dst.mac, info.wifi_ap_staconnected.mac);
                config._softAPModeStationConnectedCb(dst);
            } break;
        case WiFiEvent_t::ARDUINO_EVENT_WIFI_AP_STADISCONNECTED: {
                WiFiEventSoftAPModeStationDisconnected dst;
                dst.aid = info.wifi_ap_stadisconnected.aid;
                MEMNCPY_S(dst.mac, info.wifi_ap_stadisconnected.mac);
                config._softAPModeStationDisconnectedCb(dst);
            } break;
        default:
            break;
    }
}

