sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
#elif USE_WIFI_SET_EVENT_HANDLER_CB

// converter for System_Event_t

struct WiFiEventStationModeGotIPEx : WiFiEventStationModeGotIP
{
    WiFiEventStationModeGotIPEx(const IPAddress &_ip, const IPAddress &_mask, const IPAddress &_gw) : WiFiEventStationModeGotIP({_ip, _mask, _gw}) {}
};

struct WiFiEventStationModeConnectedEx : WiFiEventStationModeConnected {
    WiFiEventStationModeConnectedEx(const uint8_t *_ssid, size_t ssidLen, const uint8_t *_bssid, size_t bssidLen, uint8_t channel) : WiFiEventStationModeConnected({String(), {}, channel}) {
        ssid.concat(reinterpret_cast<const char *>(_ssid), ssidLen);
        memcpy_P(bssid, _bssid, std::min(sizeof(bssid), bssidLen));
    }
};

struct WiFiEventStationModeDisconnectedEx : WiFiEventStationModeDisconnected {
    WiFiEventStationModeDisconnectedEx(const uint8_t *_ssid, size_t ssidLen, const uint8_t *_bssid, size_t bssidLen, uint8_t reason) : WiFiEventStationModeDisconnected({String(), {}, static_cast<WiFiDisconnectReason>(reason)}) {
        ssid.concat(reinterpret_cast<const char *>(_ssid), ssidLen);
        memcpy_P(bssid, _bssid, std::min(sizeof(bssid), bssidLen));
    }
};

struct WiFiEventSoftAPModeStationDisconnectedEx : WiFiEventSoftAPModeStationDisconnected {
    WiFiEventSoftAPModeStationDisconnectedEx(const uint8_t *_mac, size_t macLen, uint8_t aid) : WiFiEventSoftAPModeStationDisconnected({{}, aid}) {
        memcpy_P(mac, _mac, std::min(sizeof(mac), macLen));
    }
};

struct WiFiEventSoftAPModeStationConnectedEx : WiFiEventSoftAPModeStationConnected {
    WiFiEventSoftAPModeStationConnectedEx(uint8_t rssi, const uint8_t *_mac, size_t macLen) : WiFiEventSoftAPModeStationConnected({static_cast<uint8_t>(rssi), {}}) {
        memcpy_P(mac, _mac, std::min(sizeof(mac), macLen));
    }
};

struct WiFiSystemEventEx : System_Event_t {

    operator WiFiEventStationModeConnected() const {
        auto &info = event_info.connected;
        return WiFiEventStationModeConnectedEx(info.ssid, sizeof(info.ssid), info.bssid, sizeof(info.ssid_len), info.channel);
    }
    operator WiFiEventStationModeDisconnected() const {
        auto &info = event_info.disconnected;
        return WiFiEventStationModeDisconnectedEx(info.ssid, info.ssid_len, info.bssid, sizeof(info.bssid), info.reason);
    }
    operator WiFiEventStationModeGotIP() const {
        auto &info = event_info.got_ip;
        return WiFiEventStationModeGotIPEx(info.ip.addr, info.mask.addr, info.gw.addr);
    }
    operator WiFiEventSoftAPModeStationConnected() const {
        auto &info = event_info.sta_connected;
        return WiFiEventSoftAPModeStationConnectedEx(info.aid, info.mac, sizeof(info.mac));
    }
    operator WiFiEventSoftAPModeStationDisconnected() const {
        auto &info = event_info.sta_disconnected;
        return WiFiEventSoftAPModeStationDisconnectedEx(info.mac, sizeof(info.mac), info.aid);
    }

    const __FlashStringHelper *eventToString() const {
        switch(event) {
            case EVENT_STAMODE_CONNECTED:
                return F("STAMODE_CONNECTED");
            case EVENT_STAMODE_DISCONNECTED:
                return F("STAMODE_DISCONNECTED");
            case EVENT_STAMODE_AUTHMODE_CHANGE:
                return F("STAMODE_AUTHMODE_CHANGE");
            case EVENT_STAMODE_GOT_IP:
                return F("STAMODE_GOT_IP");
            case EVENT_STAMODE_DHCP_TIMEOUT:
                return F("STAMODE_DHCP_TIMEOUT");
            case EVENT_SOFTAPMODE_STACONNECTED:
                return F("SOFTAPMODE_STACONNECTED");
            case EVENT_SOFTAPMODE_STADISCONNECTED:
                return F("SOFTAPMODE_STADISCONNECTED");
            case EVENT_SOFTAPMODE_PROBEREQRECVED:
                return F("SOFTAPMODE_PROBEREQRECVED");
            case EVENT_OPMODE_CHANGED:
                return F("OPMODE_CHANGED");
            case EVENT_SOFTAPMODE_DISTRIBUTE_STA_IP:
                return F("SOFTAPMODE_DISTRIBUTE_STA_IP");
            default:
                break;
        }
        return F("UNKNOWN");
    }
};

void KFCFWConfiguration::_onWiFiEvent(System_Event_t *orgEventPtr)
{
    auto &orgEvent = *reinterpret_cast<WiFiSystemEventEx *>(orgEventPtr);
    __LDBG_printf("event=%u(%s)", orgEvent.event, orgEvent.eventToString());
    switch(orgEvent.event) {
        case EVENT_STAMODE_CONNECTED:
            config._onWiFiConnectCb(orgEvent);
            break;
        case EVENT_STAMODE_DISCONNECTED:
            config._onWiFiDisconnectCb(orgEvent);
            break;
        case EVENT_STAMODE_GOT_IP:
            config._onWiFiGotIPCb(orgEvent);
            break;
        case EVENT_STAMODE_DHCP_TIMEOUT:
            config._onWiFiOnDHCPTimeoutCb();
            break;
        case EVENT_SOFTAPMODE_STACONNECTED:
            config._softAPModeStationConnectedCb(orgEvent);
            break;
        case EVENT_SOFTAPMODE_STADISCONNECTED:
            config._softAPModeStationDisconnectedCb(orgEvent);
            break;
    }
}

#else

static void __onWiFiConnectCb(const WiFiEventStationModeConnected &event)
{
    config._onWiFiConnectCb(event);
}

static void __onWiFiGotIPCb(const WiFiEventStationModeGotIP &event)
{
    config._onWiFiGotIPCb(event);
}

static void __onWiFiDisconnectCb(const WiFiEventStationModeDisconnected& event)
{
    config._onWiFiDisconnectCb(event);
}

static void __onWiFiOnDHCPTimeoutCb()
{
    config._onWiFiOnDHCPTimeoutCb();
}

static void __softAPModeStationConnectedCb(const WiFiEventSoftAPModeStationConnected &event)
{
    config._softAPModeStationConnectedCb(event);
}

static void __softAPModeStationDisconnectedCb(const WiFiEventSoftAPModeStationDisconnected &event)
{
    config._softAPModeStationDisconnectedCb(event);
}

#endif

void KFCFWConfiguration::_setupWiFiCallbacks()
{
    #if defined(ESP32)
        WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_CONNECTED);
        WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
        WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_GOT_IP);
        #if DEBUG
            WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_GOT_IP6);
        #endif
        WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_STA_LOST_IP);
        WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_AP_STACONNECTED);
        WiFi.onEvent(_onWiFiEvent, WiFiEvent_t::ARDUINO_EVENT_WIFI_AP_STADISCONNECTED);

