sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    #elif USE_WIFI_SET_EVENT_HANDLER_CB

        wifi_set_event_handler_cb(&KFCFWConfiguration::_onWiFiEvent);

    #else
        _onWiFiConnect = WiFi.onStationModeConnected(__onWiFiConnectCb); // using a lambda function costs 24 byte RAM per handler
        _onWiFiGotIP = WiFi.onStationModeGotIP(__onWiFiGotIPCb);
        _onWiFiDisconnect = WiFi.onStationModeDisconnected(__onWiFiDisconnectCb);
        _onWiFiOnDHCPTimeout = WiFi.onStationModeDHCPTimeout(__onWiFiOnDHCPTimeoutCb);
        _softAPModeStationConnected = WiFi.onSoftAPModeStationConnected(__softAPModeStationConnectedCb);
        _softAPModeStationDisconnected = WiFi.onSoftAPModeStationDisconnected(__softAPModeStationDisconnectedCb);
    #endif
}

void KFCFWConfiguration::recoveryMode(bool resetPasswords)
{
    if (resetPasswords) {
        System::Device::setPassword(SPGM(defaultPassword));
        Network::WiFi::setSoftApPassword(SPGM(defaultPassword));
    }
    if (!System::Device::getPassword() || !*System::Device::getPassword()) {
        System::Device::setPassword(SPGM(defaultPassword));
    }
    if (!Network::WiFi::getSoftApPassword() || !*Network::WiFi::getSoftApPassword()) {
        Network::WiFi::setSoftApPassword(SPGM(defaultPassword));
    }
    Network::WiFi::setSoftApSSID(defaultDeviceName());
    auto &flags = System::Flags::getWriteableConfig();
    flags.is_softap_ssid_hidden = false;
    flags.is_softap_dhcpd_enabled = true;
    #if IOT_REMOTE_CONTROL
        flags.is_softap_standby_mode_enabled = false;
        flags.is_softap_enabled = false;
    #else
        flags.is_softap_standby_mode_enabled = true;
        flags.is_softap_enabled = false;
        KFC_SAFE_MODE_SERIAL_PORT.printf_P(PSTR("Recovery mode SSID %s\n"), Network::WiFi::getSoftApSSID());
    #endif
    flags.is_web_server_enabled = true;
}

String KFCFWConfiguration::defaultDeviceName()
{
    uint8_t mac[WL_MAC_ADDR_LENGTH];
    WiFi.macAddress(mac);
    return PrintString(F("KFC%02X%02X%02X"), mac[3], mac[4], mac[5]);
}

// TODO add option to keep WiFi SSID, username and password

void KFCFWConfiguration::restoreFactorySettings()
{
    PrintString str;

    #undef __DBG_CALL
    #define __DBG_CALL(...) \
        __VA_ARGS__;

    __DBG_CALL(erase());
    __DBG_CALL(clear());
    __DBG_CALL((SaveCrash::clearStorage(SaveCrash::ClearStorageType::REMOVE_MAGIC));

    __DBG_CALL(auto deviceName = defaultDeviceName()));
    __DBG_CALL(System::Flags::defaults());
    __DBG_CALL(System::Firmware::defaults());
    __DBG_CALL(System::Device::defaults(true));
    __DBG_CALL(System::Device::setName(deviceName));
    // __DBG_CALL(System::Device::setTitle(FSPGM(KFC_Firmware, "KFC Firmware")));
    __DBG_CALL(System::Device::setPassword(FSPGM(defaultPassword, "12345678")));
    __DBG_CALL(System::WebServer::defaults());
    __DBG_CALL(Network::WiFi::setSSID0(deviceName));
    __DBG_CALL(Network::WiFi::setPassword0(FSPGM(defaultPassword)));
    __DBG_CALL(Network::WiFi::setSoftApSSID(deviceName));
    __DBG_CALL(Network::WiFi::setSoftApPassword(FSPGM(defaultPassword)));
    __DBG_CALL(Network::Settings::defaults());
    __DBG_CALL(Network::SoftAP::defaults());

    using Plugins = KFCConfigurationClasses::PluginsType;

    #if MQTT_SUPPORT
        __DBG_CALL(Plugins::MqttClient::defaults());
    #endif
    #if IOT_REMOTE_CONTROL
        __DBG_CALL(Plugins::RemoteControl::defaults());
    #endif
    #if SERIAL2TCP_SUPPORT
        __DBG_CALL(Plugins::Serial2TCP::defaults());
    #endif
    #if SYSLOG_SUPPORT
        __DBG_CALL(Plugins::SyslogClient::defaults());
    #endif
    #if NTP_CLIENT
        __DBG_CALL(Plugins::NTPClient::defaults());
    #endif
    #if IOT_ALARM_PLUGIN_ENABLED
        __DBG_CALL(Plugins::Alarm::defaults());
    #endif
    #if IOT_WEATHER_STATION
        __DBG_CALL(Plugins::WeatherStation::defaults());
    #endif
    #if IOT_SENSOR
        __DBG_CALL(Plugins::Sensor::defaults());
    #endif
    #if IOT_BLINDS_CTRL
        __DBG_CALL(Plugins::Blinds::defaults());
    #endif
    #if PING_MONITOR_SUPPORT
        __DBG_CALL(Plugins::Ping::defaults());
    #endif
    #if IOT_DIMMER_MODULE || IOT_ATOMIC_SUN_V2
        __DBG_CALL(Plugins::Dimmer::defaults());
    #endif
    #if IOT_CLOCK
        __DBG_CALL(Plugins::Clock::defaults());
    #endif

    #if CUSTOM_CONFIG_PRESET
        __DBG_CALL(customSettings());
    #endif
    Logger_warning(F("Factory settings restored"));

    #if SECURITY_LOGIN_ATTEMPTS
        __DBG_CALL(KFCFS.remove(FSPGM(login_failure_file)));
    #endif
}

#if CUSTOM_CONFIG_PRESET
    // set CUSTOM_CONFIG_PRESET to 0 if no custom config is being used
    #include "retracted/custom_config.h"
#endif

void KFCFWConfiguration::gc()
{
    if (_readAccess && millis() > _readAccess + _garbageCollectionCycleDelay) {
        // _debug_println(F("KFCFWConfiguration::gc(): releasing memory"));
        release();
    }
}

void KFCFWConfiguration::setConfigDirty(bool dirty)
{
    _dirty = dirty;
}

bool KFCFWConfiguration::isConfigDirty() const
{
    return _dirty;
}

const char __compile_date__[] PROGMEM = { __DATE__ " " __TIME__ };

const String KFCFWConfiguration::getFirmwareVersion()
{
    #if DEBUG
        #if ARDUINO_ESP8266_DEV
            return getShortFirmwareVersion() + F("." _STRINGIFY(ARDUINO_ESP8266_GIT_DESC) "-dev " ) + FPSTR(__compile_date__);
        #elif defined(ESP8266)
            return getShortFirmwareVersion() + F("." ARDUINO_ESP8266_RELEASE " " ) + FPSTR(__compile_date__);
        #else
            return getShortFirmwareVersion() + ' ' + FPSTR(__compile_date__);
        #endif

    #else // #if DEBUG
        return getShortFirmwareVersion() + ' ' + FPSTR(__compile_date__);
    #endif
}

const __FlashStringHelper *KFCFWConfiguration::getShortFirmwareVersion_P()
{
    return F(FIRMWARE_VERSION_STR " Build " __BUILD_NUMBER);
}

const String KFCFWConfiguration::getShortFirmwareVersion()
{
    return getShortFirmwareVersion_P();
}

#if ENABLE_DEEP_SLEEP

void KFCFWConfiguration::storeQuickConnect(const uint8_t *bssid, int8_t channel)
{
    __LDBG_printf("bssid=%s channel=%d", mac2String(bssid).c_str(), channel);

    using namespace DeepSleep;

    WiFiQuickConnect quickConnect;
    if (!RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect))) {
        quickConnect = WiFiQuickConnect();
    }
    quickConnect.channel = channel;
    quickConnect.bssid = bssid;
    RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect));
}

void KFCFWConfiguration::storeStationConfig(uint32_t ip, uint32_t netmask, uint32_t gateway)
{
    __LDBG_printf("ip=%s netmask=%s gw=%s",
        IPAddress(ip).toString().c_str(),
        IPAddress(netmask).toString().c_str(),
        IPAddress(gateway).toString().c_str()
    );

    using namespace DeepSleep;

    auto quickConnect = WiFiQuickConnect();
    if (RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect))) {
        quickConnect.local_ip = ip;
        quickConnect.subnet = netmask;
        quickConnect.gateway = gateway;
        quickConnect.dns1 = WiFi.dnsIP();
        quickConnect.dns2 = WiFi.dnsIP(1);
        auto flags = System::Flags::getConfig();
        quickConnect.use_static_ip = flags.use_static_ip_during_wakeup || !flags.is_station_mode_dhcp_enabled;
        RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect));
    } else {
        __DBG_print("reading RTC memory failed");
    }
}

#endif

