sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
void KFCFWConfiguration::setup()
{
    String version = KFCFWConfiguration::getFirmwareVersion();
    #if ENABLE_DEEP_SLEEP
        if (!resetDetector.hasWakeUpDetected())
    #endif
    {
        Logger_notice(F("Starting KFCFW %s"), version.c_str());
        #if IOT_WEATHER_STATION_WS2812_NUM
            WeatherStationPlugin::_getInstance()._rainbowStatusLED();
        #else
            BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);
        #endif
    }

    LoopFunctions::add(KFCFWConfiguration::loop);
}

#include "build.h"

// save_crash.h
SaveCrash::Data::FirmwareVersion::FirmwareVersion() :
    major(FIRMWARE_VERSION_MAJOR),
    minor(FIRMWARE_VERSION_MINOR),
    revision(FIRMWARE_VERSION_REVISION),
    build(__BUILD_NUMBER_INT)
{
}

String SaveCrash::Data::FirmwareVersion::toString(const __FlashStringHelper *buildSep) const
{
    return PrintString(F("%u.%u.%u%s%u"), major, minor, revision, buildSep, build);
}

void SaveCrash::Data::FirmwareVersion::printTo(Print &output, const __FlashStringHelper *buildSep) const
{
    output.printf_P(PSTR("%u.%u.%u%s%u"), major, minor, revision, buildSep, build);
}


void KFCFWConfiguration::read(bool wakeup)
{
    if (!Configuration::read()) {

        Logger_error(F("Failed to read configuration, restoring factory settings"));
        config.restoreFactorySettings();
        Configuration::write();
    }
    else if (wakeup == false) {
        auto version = System::Device::getConfig().config_version;
        auto currentVersion = SaveCrash::Data::FirmwareVersion().__version;
        // uint32_t currentVersion = (FIRMWARE_VERSION << 16) | (__BUILD_NUMBER_INT & 0xffff);
        if (currentVersion != version) {

            // auto build = static_cast<uint16_t>(version);
            // version >>= 16;
            // Logger_warning(F("Upgrading EEPROM settings from %d.%d.%d.%u to " FIRMWARE_VERSION_STR "." __BUILD_NUMBER), (version >> 11) & 0x1f, (version >> 6) & 0x1f, (version & 0x3f), build);
            Logger_warning(F("Upgrading EEPROM settings from %s to " FIRMWARE_VERSION_STR "." __BUILD_NUMBER), SaveCrash::Data::FirmwareVersion(version).toString(F(".")).c_str());
            System::Device::getWriteableConfig().config_version = currentVersion;
            config.recoveryMode(false);
            System::Firmware::setMD5(ESP.getSketchMD5());
            Configuration::write();
            // SaveCrash::clearStorage(SaveCrash::ClearStorageType::REMOVE_MAGIC);
        }
    }
}

void KFCFWConfiguration::write()
{
    auto result = Configuration::write();
    if (result != Configuration::WriteResultType::SUCCESS) {
        Logger_error(F("Failed to write settings to EEPROM. %s"), Configuration::getWriteResultTypeStr(result));
    }
}

#if ESP8266

    const __FlashStringHelper *KFCFWConfiguration::getSleepTypeStr(sleep_type_t type)
    {
        switch(type) {
            case sleep_type_t::NONE_SLEEP_T:
                return F("None");
            case sleep_type_t::LIGHT_SLEEP_T:
                return F("Light");
            case sleep_type_t::MODEM_SLEEP_T:
                return F("Modem");
            default:
                break;
        }
        return F("Unknown");
    }

    const __FlashStringHelper *KFCFWConfiguration::getWiFiOpModeStr(uint8_t mode)
    {
        switch(mode) {
            case WiFiMode_t::WIFI_STA:
                return F("Station mode");
            case WiFiMode_t::WIFI_AP:
                return F("AP mode");
            case WiFiMode_t::WIFI_AP_STA:
                return F("AP and station mode");
            case WiFiMode_t::WIFI_OFF:
                return F("Off");
            default:
                break;
        }
        return F("Unknown");
    }

    const __FlashStringHelper *KFCFWConfiguration::getWiFiPhyModeStr(phy_mode_t mode)
    {
        switch(mode) {
            case phy_mode_t::PHY_MODE_11B:
                return F("802.11b");
            case phy_mode_t::PHY_MODE_11G:
                return F("802.11g");
            case phy_mode_t::PHY_MODE_11N:
                return F("802.11n");
            default:
                break;
        }
        return F("");
    }

#endif

void KFCFWConfiguration::printDiag(Print &output, const String &prefix)
{
    #if ESP8266
        station_config wifiConfig;
        wifi_station_get_config_default(&wifiConfig);
        output.print(prefix);
        output.printf_P(PSTR("default cfg ssid=%.32s password=%.64s bssid_set=%u bssid=%s mode=%s\n"), wifiConfig.ssid, wifiConfig.password, wifiConfig.bssid_set, mac2String(wifiConfig.bssid).c_str(), KFCFWConfiguration::getWiFiOpModeStr(wifi_get_opmode_default()));
        wifi_station_get_config(&wifiConfig);
        output.print(prefix);
        output.printf_P(PSTR("config ssid=%.32s password=%.64s bssid_set=%u bssid=%s mode=%s\n"), wifiConfig.ssid, wifiConfig.password, wifiConfig.bssid_set, mac2String(wifiConfig.bssid).c_str(), KFCFWConfiguration::getWiFiOpModeStr(wifi_get_opmode()));
        output.print(prefix);
        output.printf_P(PSTR("sleep=%s phy=%s channel=%u AP_id=%u auto_connect=%u reconnect=%u persistent=%u\n"), KFCFWConfiguration::getSleepTypeStr(wifi_get_sleep_type()), KFCFWConfiguration::getWiFiPhyModeStr(wifi_get_phy_mode()), wifi_get_channel(), wifi_station_get_current_ap_id(), wifi_station_get_auto_connect(), wifi_station_get_reconnect_policy(), WiFi.getPersistent());

        auto lastError = config.getLastErrorStr();
        if (lastError.length()) {
            output.print(prefix);
            output.printf_P(PSTR("last_error=%s\n"), lastError.c_str());
        }

        if ((WiFi.getMode() & WiFiMode_t::WIFI_STA)) {
            if (WiFi.isConnected()) {
                output.print(prefix);
                output.printf_P(PSTR("station_ip=%s gw=%s dns=%s, %s\n"), WiFi.localIP().toString().c_str(), WiFi.gatewayIP().toString().c_str(), WiFi.dnsIP(0).toString().c_str(), WiFi.dnsIP(1).toString().c_str());
            }
            else {
                output.print(prefix);
                output.println(F("station not connected"));
            }
        }

        if ((WiFi.getMode() & WiFiMode_t::WIFI_AP)) {
            output.print(prefix);
            output.printf_P(PSTR("softap_ip=%s ssid=%s clients=%u\n"), WiFi.softAPIP().toString().c_str(), WiFi.softAPSSID().c_str(), WiFi.softAPgetStationNum());
        }
    #elif ESP32
        WiFi.printDiag(output);
    #endif
}

