sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
bool KFCFWConfiguration::resolveZeroConf(const String &name, const String &hostname, uint16_t port, MDNSResolver::ResolvedCallback callback) const
{
    __LDBG_printf("resolveZeroConf=%s port=%u", hostname.c_str(), port);
    String prefix, suffix;
    auto start = hostname.indexOf(FSPGM(_var_zeroconf));
    if (start != -1) {
        start += 11;
        auto end = hostname.indexOf('}', start);
        if (end != -1) {
            auto serviceEnd = hostname.indexOf('.');
            auto protoEnd = hostname.indexOf(',');
            auto valuesEnd = hostname.indexOf('|');
            __LDBG_printf("start=%d end=%d service_end=%d proto_end=%d name_end=%d", start, end, serviceEnd, protoEnd, valuesEnd);
            if (serviceEnd != -1 && protoEnd != -1 && serviceEnd < protoEnd && (valuesEnd == -1 || protoEnd < valuesEnd)) {
                auto service = hostname.substring(start, serviceEnd);
                auto proto = hostname.substring(serviceEnd + 1, protoEnd);
                prefix = hostname.substring(0, start - 11);
                suffix = hostname.substring(end + 1);
                String addressValue;
                String portValue;
                String defaultValue;
                int portPos;
                if (valuesEnd == -1) {
                    addressValue = hostname.substring(protoEnd + 1, end);
                }
                else {
                    addressValue = hostname.substring(protoEnd + 1, valuesEnd);
                    defaultValue = hostname.substring(valuesEnd + 1, end);
                    if ((portPos = defaultValue.indexOf(':')) != -1) {
                        port = defaultValue.substring(portPos + 1).toInt();
                        defaultValue.remove(portPos);
                    }
                }
                if ((portPos = addressValue.indexOf(':')) != -1) {
                    portValue = addressValue.substring(portPos + 1);
                    addressValue.remove(portPos);
                }
                else {
                    portValue = FSPGM(port);
                }
                if (service.charAt(0) != '_') {
                    service = String('_') + service;
                }
                if (proto.charAt(0) != '_') {
                    proto = String('_') + proto;
                }

                __LDBG_printf("service=%s proto=%s values=%s:%s default=%s port=%d", service.c_str(), proto.c_str(), addressValue.c_str(), portValue.c_str(), defaultValue.c_str(), port);

                auto mdns = PluginComponent::getPlugin<MDNSPlugin>(F("mdns"), true);
                if (!mdns) {
                    Logger_error(F("Cannot resolve Zeroconf, MDNS plugin not loaded: %s"), hostname.c_str());
                    LoopFunctions::callOnce([defaultValue, port, callback]() {
                        callback(defaultValue, IPAddress(), port, defaultValue, MDNSResolver::ResponseType::TIMEOUT);
                    });
                    return true;
                }

                mdns->resolveZeroConf(new MDNSResolver::Query(name, service, proto, addressValue, portValue, defaultValue, port, prefix, suffix, callback, System::Device::getConfig().zeroconf_timeout));
                return true;

            }
        }
    }
    return false;
}

bool KFCFWConfiguration::hasZeroConf(const String &hostname) const
{
    auto pos = hostname.indexOf(FSPGM(_var_zeroconf));
    if (pos != -1) {
        pos = hostname.indexOf('}', pos + 11);
    }
    __LDBG_printf("has_zero_conf=%s result=%d", hostname.c_str(), pos);
    return pos != -1;
}

void KFCFWConfiguration::wifiQuickConnect()
{
    __LDBG_printf("quick connect");
    #if ENABLE_DEEP_SLEEP

        #if defined(ESP32)
            WiFi.mode(WIFI_STA); // needs to be called to initialize wifi
            wifi_config_t _config;
            wifi_sta_config_t &config = _config.sta;
            if (esp_wifi_get_config(ESP_IF_WIFI_STA, &_config) == ESP_OK) {
        #elif defined(ESP8266)

            WiFi.persistent(false);
            struct station_config config;
            if (wifi_station_get_config_default(&config)) {
        #endif
            int32_t channel;
            uint8_t *bssidPtr;
            DeepSleep::WiFiQuickConnect quickConnect;

            if (RTCMemoryManager::read(PluginComponent::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect))) {
                channel = quickConnect.channel;
                bssidPtr = quickConnect.bssid;
            } else {
                quickConnect = {};
                channel = 0;
                // bssidPtr = nullptr;
            }

            WiFi.per

            if (channel <= 0 || !bssidPtr) {

                __LDBG_printf("Cannot read quick connect from RTC memory, running WiFi.begin(%s, ***) only", config.ssid);
                if (WiFi.begin(reinterpret_cast<char *>(config.ssid), reinterpret_cast<char *>(config.password)) != WL_DISCONNECTED) {
                    Logger_error(F("Failed to start WiFi"));
                }

            } else {

                if (quickConnect.use_static_ip && quickConnect.local_ip) {
                    __LDBG_printf("configuring static ip");
                    WiFi.config(quickConnect.local_ip, quickConnect.gateway, quickConnect.subnet, quickConnect.dns1, quickConnect.dns2);
                }

                wl_status_t result;
                if ((result = WiFi.begin(reinterpret_cast<char *>(config.ssid), reinterpret_cast<char *>(config.password), channel, bssidPtr, true)) != WL_DISCONNECTED) {
                    Logger_error(F("Failed to start WiFi"));
                }

                __LDBG_printf("WiFi.begin() = %d, ssid %.32s, channel %d, bssid %s, config: static ip %d, %s/%s gateway %s, dns %s, %s",
                    result,
                    config.ssid,
                    channel,
                    mac2String(bssidPtr).c_str(),
                    quickConnect.use_static_ip ? 1 : 0,
                    __S(IPAddress(quickConnect.local_ip)),
                    inet_nto_cstr(quickConnect.gateway),
                    inet_nto_cstr(quickConnect.subnet),
                    inet_nto_cstr(quickConnect.dns1),
                    inet_nto_cstr(quickConnect.dns2)
                );

