sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
            }

        } else {
            Logger_error(F("Failed to load WiFi configuration"));
        }
    #endif
}

#if ENABLE_DEEP_SLEEP

void KFCFWConfiguration::enterDeepSleep(milliseconds time, RFMode mode, uint16_t delayAfterPrepare)
{
    __DBG_printf("time=%d mode=%d delay_prep=%d", time.count(), mode, delayAfterPrepare);

    // WiFiCallbacks::getVector().clear(); // disable WiFi callbacks to speed up shutdown
    // Scheduler.terminate(); // halt scheduler

    //resetDetector.clearCounter();
    // SaveCrash::removeCrashCounter();

    delay(1);

    for(auto plugin: PluginComponents::Register::getPlugins()) {
        plugin->prepareDeepSleep(time.count());
    }
    if (delayAfterPrepare) {
        delay(delayAfterPrepare);
    }
    __LDBG_printf("Entering deep sleep for %u milliseconds, RF mode %d", time.count(), mode);

#if __LED_BUILTIN == NEOPIXEL_PIN_ID
    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::OFF);
#endif

    DeepSleep::DeepSleepParam::enterDeepSleep(time, mode);
}

#endif

#if IOT_LED_MATRIX_OUTPUT_PIN
extern "C" void ClockPluginClearPixels();
#endif

static void invoke_ESP_restart()
{
    #if IOT_LED_MATRIX_OUTPUT_PIN
        ClockPluginClearPixels();
    #endif
    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::OFF);
    #if BUILTIN_LED_NEOPIXEL
        WS2812LEDTimer::terminate();
    #endif
    __Scheduler.end();
    ETSTimerEx::end();
    #if IOT_SWITCH && IOT_SWITCH_STORE_STATES_RTC_MEM
        SwitchPlugin::_rtcMemStoreState();
    #endif
    #if RTC_SUPPORT == 0
        RTCMemoryManager::storeTime();
    #endif
    ESP.restart();
}

#if PIN_MONITOR
#include "pin_monitor.h"
#endif

void KFCFWConfiguration::resetDevice(bool safeMode)
{
    String msg = F("Device is being reset");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    delay(500);

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    #if ENABLE_DEEP_SLEEP
        DeepSleep::DeepSleepParam::reset();
    #endif
    invoke_ESP_restart();
}

// enable debugging output (::printf) for shutdown sequence
#define DEBUG_SHUTDOWN_SEQUENCE DEBUG
#if DEBUG_SHUTDOWN_SEQUENCE
#   define _DPRINTF(msg, ...) ::printf(PSTR(msg "\n"), ##__VA_ARGS__)
#else
#   define _DPRINTF(...)
#endif


void KFCFWConfiguration::restartDevice(bool safeMode)
{
    __LDBG_println();

    String msg = F("Device is being restarted");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);

    delay(500);

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    #if ENABLE_DEEP_SLEEP
        DeepSleep::DeepSleepParam::reset();
    #endif
    if (_safeMode) {
        #if DEBUG_SHUTDOWN_SEQUENCE
            _DPRINTF("safe mode: invoking restart");
        #endif
        invoke_ESP_restart();
    }

    // clear queue silently
    ADCManager::terminate(false);

    #if HTTP2SERIAL_SUPPORT
        _DPRINTF("terminating http2serial instance");
        Http2Serial::destroyInstance();
    #endif

    _DPRINTF("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u", _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());

    auto webUiSocket = WebUISocket::getServerSocket();
    if (webUiSocket) {
        _DPRINTF("terminating webui websocket=%p", webUiSocket);
        webUiSocket->shutdown();
    }

    // execute in reverse order
    auto &plugins = PluginComponents::RegisterEx::getPlugins();
    for(auto iterator = plugins.rbegin(); iterator != plugins.rend(); ++iterator) {
        const auto plugin = *iterator;
        _DPRINTF("shutdown plugin=%s", plugin->getName_P());
        plugin->shutdown();
        plugin->clearSetupTime();
    }

    _DPRINTF("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u", _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());

    #if PIN_MONITOR
        _DPRINTF("terminating pin monitor");
        PinMonitor::pinMonitor.end();
    #endif

    _DPRINTF("terminating serial handlers");
    serialHandler.end();
    #if DEBUG
        debugStreamWrapper.clear();
    #endif

    #if DEBUG_SHUTDOWN_SEQUENCE
        _DPRINTF("clearing wifi callbacks");
    #endif
    WiFiCallbacks::clear();

    #if DEBUG_SHUTDOWN_SEQUENCE
        _DPRINTF("clearing loop functions");
    #endif
    LoopFunctions::clear();

    #if DEBUG_SHUTDOWN_SEQUENCE
        _DPRINTF("invoking restart");
    #endif
    invoke_ESP_restart();
}

void KFCFWConfiguration::loop()
{
    config.gc();
}

uint8_t KFCFWConfiguration::getMaxWiFiChannels()
{
    wifi_country_t country;
    if (!wifi_get_country(&country)) {
        country.nchan = 255;
    }
    return country.nchan;
}

const __FlashStringHelper *KFCFWConfiguration::getWiFiEncryptionType(uint8_t type)
{
    #if defined(ESP32)
        switch(type) {
            case WIFI_AUTH_OPEN:
                return F("open");
            case WIFI_AUTH_WEP:
                return F("WEP");
            case WIFI_AUTH_WPA_PSK:
                return F("WPA/PSK");
            case WIFI_AUTH_WPA2_PSK:
                return F("WPA2/PSK");
            case WIFI_AUTH_WPA_WPA2_PSK:
                return F("WPA/WPA2/PSK");
            case WIFI_AUTH_WPA2_ENTERPRISE:
                return F("WPA2/ENTERPRISE");
        }
    #elif defined(ESP8266)
        switch(type) {
            case ENC_TYPE_NONE:
                return F("open");
            case ENC_TYPE_WEP:
                return F("WEP");
            case ENC_TYPE_TKIP:
                return F("WPA/PSK");
            case ENC_TYPE_CCMP:
                return F("WPA2/PSK");
            case ENC_TYPE_AUTO:
                return F("auto");
        }
    #endif
    return F("N/A");
}

bool KFCFWConfiguration::reconfigureWiFi(const __FlashStringHelper *msg, uint8_t configNum)
{
    if (msg) {
        Logger_notice(msg);
        #if DEBUG_KFC_CONFIG
            __DBG_printf("WiFi diagnostics");
            WiFi.printDiag(DEBUG_OUTPUT);
        #endif
    }
    WiFi.persistent(false); // disable storing WiFi config
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(true);
    WiFi.softAPdisconnect(true);

    return connectWiFi(configNum);
}

bool KFCFWConfiguration::connectWiFi(uint8_t configNum, bool ignoreSoftAP)
{
    setLastError(String());
    if (configNum != kKeepWiFiNetwork) {
        _wifiNumActive = configNum;
    }

    bool station_mode_success = false;
    bool ap_mode_success = false;

    auto flags = System::Flags::getConfig();
    if (flags.is_station_mode_enabled) {
        __LDBG_printf("init station mode");
        WiFi.setAutoConnect(false); // WiFi callbacks have to be installed first during boot
        WiFi.setAutoReconnect(true);

        auto wifiId = getWiFiConfigurationNum();
        auto network = Network::WiFi::getNetworkConfigOrdered(wifiId);
        bool result;
        if (network.isDHCPEnabled()) {
            result = WiFi.config(0U, 0U, 0U, 0U, 0U);
        }
        else {
            result = WiFi.config(network.getLocalIp(), network.getGateway(), network.getSubnet(), network.getDns1(), network.getDns2());
        }
        if (!result) {
            setLastError(PrintString(F("Failed to configure Station Mode with %s"), network.isDHCPEnabled() ? PSTR("DHCP") : PSTR("static address")));
            Logger_error(F("%s"), getLastError());
        }
        else {

            if (WiFi.begin(Network::WiFi::getSSID(wifiId), Network::WiFi::getPassword(wifiId)) == WL_CONNECT_FAILED) {
                setLastError(F("Failed to start Station Mode"));
                Logger_error(F("%s"), getLastError());
            }
            else {
                __LDBG_printf("Station Mode SSID %s", Network::WiFi::getSSID(wifiId));
                station_mode_success = true;
            }
        }
    }
    else {
        __LDBG_printf("disabling station mode");
        WiFi.disconnect(true);
        station_mode_success = true;
    }

    if (!ignoreSoftAP) {

        if (flags.is_softap_enabled) {
            __LDBG_printf("init AP mode");

            auto softAp = Network::SoftAP::getConfig();
            if (!WiFi.softAPConfig(softAp.getAddress(), softAp.getGateway(), softAp.getSubnet())) {
                setLastError(F("Cannot configure AP mode"));
                Logger_error(F("%s"), getLastError());
            }
            else {
                #if defined(ESP32)

