sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
uint32_t KFCFWConfiguration::getWiFiUp()
{
    if (!WiFi.isConnected() || !config._wifiUp) {
        return 0;
    }
    return std::max(1U, get_time_diff(config._wifiUp, millis()));
}

#if 0
#    define __DBG_RTC_printf __DBG_printf
#else
#    define __DBG_RTC_printf(...) ;
#endif

TwoWire &KFCFWConfiguration::initTwoWire(bool reset, Print *output)
{
    if (output) {
        output->printf_P("I2C: SDA=%u, SCL=%u, clock stretch=%u, clock speed=%u, reset=%u\n", KFC_TWOWIRE_SDA, KFC_TWOWIRE_SCL, KFC_TWOWIRE_CLOCK_STRETCH, KFC_TWOWIRE_CLOCK_SPEED, reset);
    }
    if (!_initTwoWire || reset) {
        __DBG_RTC_printf("SDA=%u,SCL=%u,stretch=%u,speed=%u,rst=%u", KFC_TWOWIRE_SDA, KFC_TWOWIRE_SCL, KFC_TWOWIRE_CLOCK_STRETCH, KFC_TWOWIRE_CLOCK_SPEED, reset);
        _initTwoWire = true;
        Wire.begin(KFC_TWOWIRE_SDA, KFC_TWOWIRE_SCL);
        Wire.setClockStretchLimit(KFC_TWOWIRE_CLOCK_STRETCH);
        Wire.setClock(KFC_TWOWIRE_CLOCK_SPEED);
    }
    return Wire;
}

bool KFCFWConfiguration::setRTC(uint32_t unixtime)
{
    __DBG_RTC_printf("time=%u", unixtime);
    #if RTC_SUPPORT
        initTwoWire();
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                return false;
            }
        }
        rtc.adjust(DateTime(unixtime));
        return true;
    #endif
    return false;
}

void KFCFWConfiguration::setupRTC()
{
    #if RTC_SUPPORT
        // support for external RTCs
        initTwoWire();
        auto unixtime = config.getRTC();
        __DBG_RTC_printf("unixtime=%u", unixtime);
        if (unixtime != 0) {
            struct timeval tv = { static_cast<time_t>(unixtime), 0 };
            settimeofday(&tv, nullptr);
            RTCMemoryManager::setTime(unixtime, RTCMemoryManager::SyncStatus::YES);
        }
        else {
            RTCMemoryManager::setSyncStatus(false);
        }
    #else
        // support for the internal RTC
        // NTP should be used to synchronize the RTC after each restart, if possible after deep sleep as well
        // issues:
        // - inaccurate when using deep sleep
        // - no battery backup
        //
        // after a reset, the time is marked as not synchronized (rtcLostPower() == false) until set by NTP or manually
        // while it does not work if a device gets turned off, it is still ok when rebooting or recovering from a crash
        // time won't start at 1970 and the timezone is also set...
        RTCMemoryManager::setSyncStatus(false);
        auto rtc = RTCMemoryManager::readTime();
        __DBG_RTC_printf("unixtime=%u", rtc.time);
        struct timeval tv = { static_cast<time_t>(rtc.time), 0 };
        settimeofday(&tv, nullptr);
        RTCMemoryManager::setupRTC();
    #endif
}

bool KFCFWConfiguration::rtcLostPower()
{
    #if RTC_SUPPORT
        auto status = RTCMemoryManager::getSyncStatus();
        if (status == RTCMemoryManager::SyncStatus::NO) {
            return false;
        }
        initTwoWire();
        uint32_t unixtime = 0;
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                return false;
            }
        }
        unixtime = rtc.now().unixtime();
        if (unixtime == 0) {
            RTCMemoryManager::setSyncStatus(false);
        }
        return unixtime != 0;
    #else
        return RTCMemoryManager::getSyncStatus() != RTCMemoryManager::SyncStatus::YES;
    #endif
}

KFCFWConfiguration::RtcStatus KFCFWConfiguration::getRTCStatus()
{
    RtcStatus data;
    #if RTC_SUPPORT
        initTwoWire();
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                return data;
            }
        }
        data.time = rtc.now().unixtime();
        if (data.time == 0) {
            RTCMemoryManager::setSyncStatus(false);
        }
        data.temperature = rtc.getTemperature();
        data.lostPower = rtc.lostPower();
    #else
        data.time = time(nullptr);
        data.lostPower = RTCMemoryManager::getSyncStatus() != RTCMemoryManager::SyncStatus::NO;
    #endif
    return data;
}

uint32_t KFCFWConfiguration::getRTC()
{
    #if RTC_SUPPORT
        initTwoWire();
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                return 0;
            }
        }
        uint32_t unixtime = rtc.now().unixtime();
        __DBG_RTC_printf("time=%u", unixtime);
        if (rtc.lostPower()) {
            __DBG_RTC_printf("time=0, lostPower=true");
            return 0;
        }
        return unixtime;
    #endif
    __LDBG_printf("time=error");
    return 0;
}

float KFCFWConfiguration::getRTCTemperature()
{
    #if RTC_SUPPORT
        initTwoWire();
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                return NAN;
            }
        }
        return rtc.getTemperature();
    #endif
    return NAN;
}

void KFCFWConfiguration::printRTCStatus(Print &output, bool plain)
{
    RtcStatus data;
    #if RTC_SUPPORT
        initTwoWire();
    #endif

    data = getRTCStatus();
    PrintString nowStr;
    nowStr.strftime(FSPGM(strftime_date_time_zone), data.time);
    PGM_P nl = plain ? PSTR("\n") : PSTR(", ");
    output.print(F("Timestamp: "));
    output.print(nowStr);
    __DBG_RTC_printf("temp=%.3f lost_power=%u", data.temperature, data.lostPower);
    if (!isnan(data.temperature)) {
        output.printf_P(PSTR("%sTemperature: %.2f%s"), nl, data.temperature, plain ? PSTR("C") : SPGM(UTF8_degreeC));
    }
    output.printf_P(PSTR("%sLost Power: %s"), nl, data.lostPower ? SPGM(Yes) : SPGM(No));

