sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    #if RTC_SUPPORT
        if (data.time == 0) {
            output.print(F("Failed to initialize RTC"));
        }
    #endif
}

// void KFCFWConfiguration::scanWifiSignalLevel(StationVector &list)
// {
//     __DBG_printf("scan wifi signal level size=%u", list.size());
//     // check if there is any station with priority 0
//     auto iter = std::find_if(list.begin(), list.end(), [](const StationConfig &station) {
//         return station._priority == 0;
//     });
//     if (iter == list.end()) {
//         __DBG_printf("no stations in auto mode");
//         return;
//     }

//     // scan for available wifi networks
//     auto num = WiFi.scanNetworks();
//     __DBG_printf("scanNetworks=%d", num);
//     if (num <= 0) {
//         // no networks found
//         return;
//     }
//     for(auto &station: list) {
//         // find station
//         for(int8_t i = 0; i < num; i++) {
//             if (WiFi.SSID(i) == station._SSID) {
//                 if (station._priority == 0) {
//                     // update priority
//                     station._priority = -WiFi.RSSI(i);
//                 }
//                 if (WiFi.BSSID(i)) {
//                     memmove_P(station._bssid, WiFi.BSSID(i), sizeof(station._bssid));
//                 }
//             }
//         }
//     }
// }

// KFCFWConfiguration::StationVector KFCFWConfiguration::getStations() const
// {
//     return Network::WiFi::getStations(KFCFWConfiguration::scanWifiSignalLevel);
// }

static KFCConfigurationPlugin plugin;

PROGMEM_DEFINE_PLUGIN_OPTIONS(
    KFCConfigurationPlugin,
    "cfg",              // name
    "cfg",              // friendly name
    // web_templates (class StatusTemplate)
    "index,status",
    // config_forms
    "wifi,network,device,password",
    // reconfigure_dependencies
    "wifi,network",
    PluginComponent::PriorityType::CONFIG,
    PluginComponent::RTCMemoryId::CONFIG,
    static_cast<uint8_t>(PluginComponent::MenuType::NONE),
    true,               // allow_safe_mode
    true,               // setup_after_deep_sleep
    false,              // has_get_status
    true,               // has_config_forms
    false,              // has_web_ui
    true,               // has_web_templates
    false,              // has_at_mode
    0                   // __reserved
);

KFCConfigurationPlugin::KFCConfigurationPlugin() : PluginComponent(PROGMEM_GET_PLUGIN_OPTIONS(KFCConfigurationPlugin))
{
    REGISTER_PLUGIN(this, "KFCConfigurationPlugin");
}

void KFCConfigurationPlugin::setup(SetupModeType mode, const PluginComponents::DependenciesPtr &dependencies)
{
    __DBG_printf("safe mode %d, wake up %d", (mode == SetupModeType::SAFE_MODE), resetDetector.hasWakeUpDetected());
    config.setup();

    #if NTP_LOG_TIME_UPDATE
        PrintString nowStr;
        nowStr.strftime(FSPGM(strftime_date_time_zone), time(nullptr));
        Logger_notice(F("RTC time: %s"), nowStr.c_str());
    #endif

    if (WiFi.isConnected() && !resetDetector.hasWakeUpDetected()) {
        __DBG_assert_printf(false, "WiFi up, skipping init.");
        #if !IOT_WEATHER_STATION_WS2812_NUM
            BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::SOS);
        #endif
        return;
    }

    #if ENABLE_DEEP_SLEEP
        if (!resetDetector.hasWakeUpDetected())
    #endif
    {
        config.printInfo(Serial);

        if (!config.connectWiFi()) {
            Serial.printf_P(PSTR("Configuring WiFi failed: %s\n"), config.getLastError());
            #if DEBUG
                config.dump(Serial);
            #endif
        }
    }
}

void KFCConfigurationPlugin::reconfigure(const String &source)
{
    if (source == FSPGM(network) || source == FSPGM(wifi)) {
        config.reconfigureWiFi();
    }
}

WebTemplate *KFCConfigurationPlugin::getWebTemplate(const String &name)
{
    return new StatusTemplate();
}

